job_array_planning_scripts/3d/templates_old/case_template/backGround/system/FOLambda2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

Lambda21
{
    // Mandatory entries
    type            Lambda2;
    libs            ("libfieldFunctionObjects.so");

    // Optional (inherited) entries
    field           U;
    result          Lambda2Field;
    region          region0;
    enabled         true;
    log             true;
    timeStart       0;
    timeEnd         1000;
    executeControl  writeTime;
    //executeInterval 2;
    writeControl    writeTime;
    //writeInterval   25;
}


// ************************************************************************* //
